#+TITLE: Reading the source code of Emacs!
#+DATE: 2025-10-09
#+DESCRIPTION: Reading the source code of emacs, one by one.
#+OPTIONS: toc:nil num:nil 
#+HUGO_BASE_DIR: ../../src
#+HUGO_SECTION: blog
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_FRONT_MATTER_FORMAT: yaml

* Reading the source code of Emacs!
:PROPERTIES:
:EXPORT_FILE_NAME: Building-Arrodes-02.md
:EXPORT_DATE: 2025-10-09
:EXPORT_DESCRIPTION: Reading the source code of emacs, one by one.
:EXPORT_HUGO_TAGS: arrodes, editor, emacs, elisp
:EXPORT_HUGO_DRAFT: false
:EXPORT_OPTIONS:
:END:

So when I decided to build my text editor - reality hit me in the face quite hard. I realised I know nothing about how text editors work - so I started out by watching Numberphile's
video on it - all that did was make me feel worse about the shit I didn't know. 

So I decided - given that I like emacs, why not go through the source code? So this is my attempt at that. And the repo is massive, so I need to find out what files to read in what order.

This blog basically charts my journey of going through the emacs source code, while trying to grasp stuff I guess. It includes all the code I write as well as their outputs, thanks to org mode.

** First we have to extract all the c files + their first lines.
This below code block executes to that - basically list all the files that end with .c, then for each file - get the first line (as this is the comment that has the output).
NOTE - the emacs repo is cloned to that specific path - "~/Projects/Personal/emacs"

#+begin_src emacs-lisp :exports both
(let ((files-list ;; Contains the names of list of files
       (--filter
        (string-equal (cadr (split-string it "[.]" t)) "c")
        (cddr (directory-files "~/Projects/Personal/emacs/src" t))))
      (first-lines '(("File Name" "Description"))))
  (dolist (file files-list)
    (with-temp-buffer
      (insert-file-contents file)
      (add-to-list 'first-lines (list (car (nreverse (split-string file "\/" t))) (car (split-string (buffer-string) "\n" t))))))
  (nreverse first-lines))
#+end_src

#+RESULTS:
| File Name          | Description                                                                        |
| alloc.c            | /* Storage allocation and gc for GNU Emacs Lisp interpreter.                       |
| android-emacs.c    | /* Android initialization for GNU Emacs.                                           |
| android.c          | /* Android initialization for GNU Emacs.                                           |
| androidfns.c       | /* Communication module for Android terminals.                                     |
| androidfont.c      | /* Android fallback font driver.                                                   |
| androidmenu.c      | /* Communication module for Android terminals.                                     |
| androidselect.c    | /* Communication module for Android terminals.                                     |
| androidterm.c      | /* Communication module for Android terminals.                                     |
| androidvfs.c       | /* Android virtual file-system support for GNU Emacs.                              |
| atimer.c           | /* Asynchronous timers.                                                            |
| bidi.c             | /* Low-level bidirectional buffer/string-scanning functions for GNU Emacs.         |
| bignum.c           | /* Big numbers for Emacs.                                                          |
| buffer.c           | /* Buffer manipulation primitives for GNU Emacs.                                   |
| bytecode.c         | /* Execution of byte code produced by bytecomp.el.                                 |
| callint.c          | /* Call a Lisp function interactively.                                             |
| callproc.c         | /* Synchronous subprocess invocation for GNU Emacs.                                |
| casefiddle.c       | /* -*- coding: utf-8 -*- */                                                            |
| casetab.c          | /* GNU Emacs routines to deal with case tables.                                    |
| category.c         | /* GNU Emacs routines to deal with category tables.                                |
| ccl.c              | /* CCL (Code Conversion Language) interpreter.                                     |
| character.c        | /* Basic character support.                                                        |
| charset.c          | /* Basic character set support.                                                    |
| chartab.c          | /* chartab.c -- char-table support                                                 |
| cm.c               | /* Cursor motion subroutines for GNU Emacs.                                        |
| cmds.c             | /* Simple built-in editing commands.                                               |
| coding.c           | /* Coding system handler (conversion, detection, etc).                             |
| comp.c             | /* Compile Emacs Lisp into native code.                                            |
| composite.c        | /* Composite sequence support.                                                     |
| cygw32.c           | /* Cygwin support routines.                                                        |
| data.c             | /* Primitive operations on Lisp data types for GNU Emacs Lisp interpreter.         |
| dbusbind.c         | /* Elisp bindings for D-Bus.                                                       |
| decompress.c       | /* Interface to zlib.                                                              |
| dired.c            | /* Lisp functions for making directory listings.                                   |
| dispnew.c          | /* Updating of data structures for redisplay.                                      |
| doc.c              | /* Record indices of function doc strings stored in a file. -*- coding: utf-8 -*-    |
| doprnt.c           | /* Output like sprintf to a buffer of specified size.    -*- coding: utf-8 -*-       |
| dosfns.c           | /* MS-DOS specific Lisp utilities.  Coded by Manabu Higashida, 1991.               |
| dynlib.c           | /* Portable API for dynamic loading.                                               |
| editfns.c          | /* Lisp functions pertaining to editing.                 -*- coding: utf-8 -*-       |
| emacs-module.c     | /* emacs-module.c - Module loading and runtime implementation                      |
| emacs.c            | /* Fully extensible Emacs, running on Unix, intended for GNU.                      |
| emacsgtkfixed.c    | /* A Gtk Widget that inherits GtkFixed, but can be shrunk.                         |
| eval.c             | /* Evaluator for GNU Emacs Lisp interpreter.                                       |
| fileio.c           | /* File IO for GNU Emacs.                                                          |
| filelock.c         | /* Lock files for editing.                                                         |
| floatfns.c         | /* Primitive operations on floating point for GNU Emacs Lisp interpreter.          |
| fns.c              | /* Random utility Lisp functions.                                                  |
| font.c             | /* font.c -- "Font" primitives.                                                    |
| fontset.c          | /* Fontset handler.                                                                |
| frame.c            | /* Generic frame functions.                                                        |
| fringe.c           | /* Fringe handling (split from xdisp.c).                                           |
| ftcrfont.c         | /* ftcrfont.c -- FreeType font driver on cairo.                                    |
| ftfont.c           | /* ftfont.c -- FreeType font driver.                                               |
| gfilenotify.c      | /* Filesystem notifications support with glib API.                                 |
| gmalloc.c          | /* Declarations for `malloc' and friends.                                          |
| gnutls.c           | /* GnuTLS glue for GNU Emacs.                                                      |
| gtkutil.c          | /* Functions for creating and updating GTK widgets.                                |
| haiku.c            | /* Haiku subroutines that are general to the Haiku operating system.               |
| haiku_io.c         | /* Haiku window system support.                                                    |
| haikufns.c         | /* Haiku window system support                                                     |
| haikufont.c        | /* Font support for Haiku windowing                                                |
| haikuimage.c       | /* Haiku window system support.                                                    |
| haikumenu.c        | /* Haiku window system support                                                     |
| haikuselect.c      | /* Haiku window system selection support.                                          |
| haikuterm.c        | /* Haiku window system support                                                     |
| hbfont.c           | /* hbfont.c -- Platform-independent support for HarfBuzz font driver.              |
| image.c            | /* Functions for image support on window system.                                   |
| indent.c           | /* Indentation functions.                                                          |
| inotify.c          | /* Inotify support for Emacs                                                       |
| insdel.c           | /* Buffer insertion/deletion and gap motion for GNU Emacs. -*- coding: utf-8 -*-     |
| intervals.c        | /* Code for doing intervals.                                                       |
| itree.c            | /* This file implements an efficient interval data-structure.                      |
| json.c             | /* JSON parsing and serialization.                                                 |
| keyboard.c         | /* Keyboard and mouse input; editor command loop.                                  |
| keymap.c           | /* Manipulation of keymaps                                                         |
| kqueue.c           | /* Filesystem notifications support with kqueue API.                               |
| lcms.c             | /* Interface to Little CMS                                                         |
| lread.c            | /* Lisp parsing and input streams.                                                 |
| macros.c           | /* Keyboard macros.                                                                |
| marker.c           | /* Markers: examining, setting and deleting.                                       |
| menu.c             | /* Platform-independent code for terminal communications.                          |
| minibuf.c          | /* Minibuffer input and completion.                                                |
| msdos.c            | /* MS-DOS specific C utilities.          -*- coding: cp850 -*-                       |
| pdumper.c          | /* Copyright (C) 2018-2025 Free Software Foundation, Inc.                          |
| pgtkfns.c          | /* Functions for the pure Gtk+-3.                                                  |
| pgtkim.c           | /* Pure Gtk+-3 communication module.                                               |
| pgtkmenu.c         | /* Pure GTK3 menu and toolbar module.                                              |
| pgtkselect.c       | /* Gtk selection processing for emacs.                                             |
| pgtkterm.c         | /* Communication module for window systems using GTK.                              |
| print.c            | /* Lisp object printing and output streams.                                        |
| process.c          | /* Asynchronous subprocess control for GNU Emacs.                                  |
| profiler.c         | /* Profiler implementation.                                                        |
| ralloc.c           | /* Block-relocating memory allocator.                                              |
| regex-emacs.c      | /* Emacs regular expression matching and search                                    |
| region-cache.c     | /* Caching facts about regions of the buffer, for optimization.                    |
| scroll.c           | /* Calculate what line insertion or deletion to do, and do it                      |
| search.c           | /* String search routines for GNU Emacs.                                           |
| sfnt.c             | /* TrueType format font support for GNU Emacs.                                     |
| sfntfont-android.c | /* sfnt format font driver for Android.                                            |
| sfntfont.c         | /* sfnt format font driver for GNU Emacs.                                          |
| sort.c             | /* Timsort for sequences.                                                          |
| sound.c            | /* sound.c -- sound support.                                                       |
| sqlite.c           | /* Support for accessing SQLite databases.                                         |
| syntax.c           | /* GNU Emacs routines to deal with syntax tables; also word and list parsing.      |
| sysdep.c           | /* Interfaces to system-dependent kernel and library entries.                      |
| systhread.c        | /* System thread definitions                                                       |
| term.c             | /* Terminal control module for terminals described by TERMCAP                      |
| termcap.c          | /* Work-alike for termcap, plus extra features.                                    |
| terminal.c         | /* Functions related to terminal devices.                                          |
| terminfo.c         | /* Interface from Emacs to terminfo.                                               |
| textconv.c         | /* String conversion support for graphics terminals.                               |
| textprop.c         | /* Interface code for dealing with text properties.                                |
| thread.c           | /* Threading code.                                                                 |
| timefns.c          | /* Timestamp functions for Emacs                                                   |
| tparam.c           | /* Merge parameters into a termcap entry string.                                   |
| treesit.c          | /* Tree-sitter integration for GNU Emacs.                                          |
| undo.c             | /* undo handling for GNU Emacs.                                                    |
| vm-limit.c         | /* Functions for memory limit warnings.                                            |
| w16select.c        | /* 16-bit Windows Selection processing for emacs on MS-Windows                     |
| w32.c              | /* Utility and Unix shadow routines for GNU Emacs on the Microsoft Windows API.    |
| w32console.c       | /* Terminal hooks for GNU Emacs on the Microsoft Windows API.                      |
| w32cygwinx.c       | /* Common functions for the Microsoft Windows and Cygwin builds.                   |
| w32dwrite.c        | /* Support for using DirectWrite on MS-Windows to draw text.  This                 |
| w32fns.c           | /* Graphical user interface functions for the Microsoft Windows API.               |
| w32font.c          | /* Font backend for the Microsoft Windows API.                                     |
| w32heap.c          | /* Heap management routines for GNU Emacs on the Microsoft Windows API.            |
| w32image.c         | /* Implementation of MS-Windows native image API via the GDI+ library.             |
| w32inevt.c         | /* Input event support for Emacs on the Microsoft Windows API.                     |
| w32menu.c          | /* Menu support for GNU Emacs on the Microsoft Windows API.                        |
| w32notify.c        | /* Filesystem notifications support for GNU Emacs on the Microsoft Windows API.    |
| w32proc.c          | /* Process support for GNU Emacs on the Microsoft Windows API.                     |
| w32reg.c           | /* Emulate the X Resource Manager through the registry.                            |
| w32select.c        | /* Selection processing for Emacs on the Microsoft Windows API.                    |
| w32term.c          | /* Implementation of GUI terminal on the Microsoft Windows API.                    |
| w32uniscribe.c     | /* Font backend for the Microsoft W32 Uniscribe API.                               |
| w32xfns.c          | /* Functions taken directly from X sources for use with the Microsoft Windows API. |
| widget.c           | /* The emacs frame widget.                                                         |
| window.c           | /* Window creation, deletion and examination for GNU Emacs.                        |
| xdisp.c            | /* Display generation from window structure and buffer text.                       |
| xfaces.c           | /* xfaces.c -- "Face" primitives.                                                  |
| xfns.c             | /* Functions for the X Window System.                                              |
| xfont.c            | /* xfont.c -- X core font driver.                                                  |
| xftfont.c          | /* xftfont.c -- XFT font driver.                                                   |
| xgselect.c         | /* Function for handling the GLib event loop.                                      |
| xmenu.c            | /* X Communication module for terminals which understand the X protocol.           |
| xml.c              | /* Interface to libxml2.                                                           |
| xrdb.c             | /* Deal with the X Resource Manager.                                               |
| xselect.c          | /* X Selection processing for Emacs.                                               |
| xsettings.c        | /* Functions for handling font and other changes dynamically.                      |
| xsmfns.c           | /* Session management module for systems which understand the X Session            |
| xterm.c            | /* X Communication module for terminals which understand the X protocol.           |
| xwidget.c          | /* Support for embedding graphical components in a buffer.                         |

